In [1]:
import numpy as np
import pandas as pd
# import matplotlib.pyplot as plt
import datetime
from sqlalchemy import create_engine

In [2]:
# 初始化数据库连接，使用pymysql模块
engine = create_engine('mysql+pymysql://root:12345678@localhost:3306/chinavis')

'INSERT INTO `p202` (`date`,`PM2.5`,`PM10`,`SO2`,`NO2`,`CO`,`O3`,`U(m/s)`,`V(m/s)`,`TEMP(K)`,`RH(%)`,`PSFC(Pa)`,`lat`,`lon`) VALUES(%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s)'

In [3]:
# 查询语句，选出employee表中的所有数据
sql = '''
      select count(*) from p202;
      '''

# read_sql_query的两个参数: sql语句， 数据库连接
df = pd.read_sql_query(sql, engine)

# 输出employee表的查询结果
print(df)

   count(*)
0    442582

In [12]:
sql = '''select date, NO2 from p202 where date = str_to_date('2013-1-1','%%Y-%%m-%%d');'''
df = pd.read_sql_query(sql, engine)
df

          date    NO2
0   2013-01-01   4.58
1   2013-01-01  12.42
2   2013-01-01   1.72
3   2013-01-01   2.38
4   2013-01-01  35.32
..         ...    ...
197 2013-01-01   1.21
198 2013-01-01   0.88
199 2013-01-01   0.90
200 2013-01-01   1.18
201 2013-01-01   1.15

[202 rows x 2 columns]

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 202 entries, 0 to 201
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    202 non-null    datetime64[ns]
 1   NO2     202 non-null    float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 3.3 KB

In [14]:
feature = ['NO2']
sql = '''select date, '''+feature+''' from p202 where date = str_to_date('2013-1-1','%%Y-%%m-%%d');'''
df = pd.read_sql_query(sql, engine)
df

          date    NO2
0   2013-01-01   4.58
1   2013-01-01  12.42
2   2013-01-01   1.72
3   2013-01-01   2.38
4   2013-01-01  35.32
..         ...    ...
197 2013-01-01   1.21
198 2013-01-01   0.88
199 2013-01-01   0.90
200 2013-01-01   1.18
201 2013-01-01   1.15

[202 rows x 2 columns]